In [1]:
import pandas as pd

[Перевод строковых значений в числа](#str_to_num)

[Методы Pandas для работы с датой и временем](#D_T)

[Обработка ошибок try-except](#try_except)

«Определить, какие товарные категории и подкатегории на сайте представлены в поисковиках хуже всего»

In [2]:
data = pd.read_excel('seo_data.xlsx',sheet_name='traffic_data')

In [3]:
display(data.info())
data.tail(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB

None

     subcategory_id   source     visits  Unnamed: 3
1920     657ad4152e  organic  24.748969         NaN
1921     ee2093ef96  organic  24.468693         NaN
1922     94f5224c98  organic  24.433584         NaN
1923     3f7f42af50  organic  21.544606         NaN
1924     779e246861  organic  15.813045         NaN
1925     c51343bf77  organic  15.640773         NaN
1926     d942687638  organic   13.87554         NaN
1927     976642886f  organic   9.204211         NaN
1928     075994491e  organic   4.606261         NaN
1929          total  organic  "5687882"         NaN

In [4]:
data['source'].unique()

array(['direct', 'organic'], dtype=object)

In [5]:
subcategory_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'subcategory_ids')

In [6]:
subcategory_dict.head(10)

  subcategory_id                subcategory_name category_id
0     cf2e61c7af              Мобильные телефоны  09f279a643
1     0cd903d1cc                        Ноутбуки  3509869a61
2     ef35bc88a7                      Телевизоры  09f279a643
3     6ff9f4014c                        Планшеты  3509869a61
4     72bc238e4d  Наушники и Bluetooth-гарнитуры  09f279a643
5     88c78ea685                            Шины  65922fa39c
6     179bfacf4a           Умные часы и браслеты  09f279a643
7     b0fb8f259a                        Мониторы  3509869a61
8     3c67eb2d90                   Наручные часы  6074ad29ac
9     24e6c815c6  Лекарственные препараты и БАДы  10a493e03b

In [7]:
category_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'category_ids')

In [8]:
category_dict.head(10)

  category_id               category_name
0  09f279a643                 Электроника
1  3509869a61        Компьютерная техника
2  65922fa39c                        Авто
3  6074ad29ac  Одежда, обувь и аксессуары
4  10a493e03b         Товары для здоровья
5  5a0d8ac946             Бытовая техника
6  7dbac4c1a3              Детские товары
7  ae99947659               Спорт и отдых
8  655ccc3c49          Товары для красоты
9  394f20d8fa      Строительство и ремонт

In [9]:
print(data.groupby('source')['source'].count())

source
direct     965
organic    965
Name: source, dtype: int64

In [10]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB
None

Объединим несколько таблиц в одну методом merge(). Передавая тот или иной аргумент методу merge(), можно по-разному объединять таблицы. Подробнее об этом будет рассказано в следующем спринте.
merge() применяют к таблице, к которой присоединяют другую. У метода следующие аргументы:
right — имя DataFrame или Series, присоединяемого к исходной таблице.
on — название общего списка в двух соединяемых таблицах: по нему происходит слияние.
how — чьи id включать в итоговую таблицу. Аргумент how может принять значение left: тогда в итоговую таблицу будут включены id из левой таблицы. Аргумент right включает id из правой таблицы.

In [11]:
#Объедините самостоятельно таблицы из переменных subcategory_dict и data. Результат сохраните в переменной data_subcategory
data_subcategory = data.merge(subcategory_dict,on='subcategory_id',how='left')

In [12]:
data_subcategory

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id
0,cf2e61c7af,direct,501165.668858,NaN,Мобильные телефоны,09f279a643
1,0cd903d1cc,direct,126342.359505,NaN,Ноутбуки,3509869a61
2,ef35bc88a7,direct,95626.321402,NaN,Телевизоры,09f279a643
3,6ff9f4014c,direct,75680.653002,NaN,Планшеты,3509869a61
4,72bc238e4d,direct,64435.934651,NaN,Наушники и Bluetooth-гарнитуры,09f279a643
...,...,...,...,...,...,...
1925,c51343bf77,organic,15.640773,NaN,Свитеры и кардиганы,6074ad29ac
1926,d942687638,organic,13.87554,NaN,Термобелье,6074ad29ac
1927,976642886f,organic,9.204211,NaN,"Наклейки, шильдики и значки",65922fa39c
1928,075994491e,organic,4.606261,NaN,Гигиена полости рта,7dbac4c1a3
1929,total,organic,"""5687882""",NaN,NaN,NaN

In [13]:
#Объедините таблицы из переменных data_subcategory и category_dict.
#Результат сохраните в переменной data_final
data_final = data_subcategory.merge(category_dict,on='category_id',how='left')

In [14]:
data_final

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id,category_name
0,cf2e61c7af,direct,501165.668858,NaN,Мобильные телефоны,09f279a643,Электроника
1,0cd903d1cc,direct,126342.359505,NaN,Ноутбуки,3509869a61,Компьютерная техника
2,ef35bc88a7,direct,95626.321402,NaN,Телевизоры,09f279a643,Электроника
3,6ff9f4014c,direct,75680.653002,NaN,Планшеты,3509869a61,Компьютерная техника
4,72bc238e4d,direct,64435.934651,NaN,Наушники и Bluetooth-гарнитуры,09f279a643,Электроника
...,...,...,...,...,...,...,...
1925,c51343bf77,organic,15.640773,NaN,Свитеры и кардиганы,6074ad29ac,"Одежда, обувь и аксессуары"
1926,d942687638,organic,13.87554,NaN,Термобелье,6074ad29ac,"Одежда, обувь и аксессуары"
1927,976642886f,organic,9.204211,NaN,"Наклейки, шильдики и значки",65922fa39c,Авто
1928,075994491e,organic,4.606261,NaN,Гигиена полости рта,7dbac4c1a3,Детские товары
1929,total,organic,"""5687882""",NaN,NaN,NaN,NaN

## Перевод строковых значений в числа
<a id='str_to_num'></a>

In [15]:
transactions = pd.read_excel('ids.xlsx')

In [16]:
display(transactions['category'].unique())
transactions.head()

array(['C', 'B', 'D', 'A', 'E', 'Null'], dtype=object)

             id category    amount
0  600748331392        C  17515.36
1  600748331404        B  10117.56
2  600748331412        B  18489.26
3  600748331430        B   6620.22
4  600748331447        C    7559.9

In [17]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     object
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

transactions['amount'] = pd.to_numeric(transactions['amount']) 


У метода to_numeric() есть параметр errors. От значений, принимаемых errors, зависят действия to_numeric при встрече с некорректным значением:
`errors='raise' — дефолтное поведение: при встрече с некорректным значением выдаётся ошибка, операция перевода в числа прерывается;


`errors='coerce' — некорректные значения принудительно заменяются на NaN;


`errors='ignore' — некорректные значения игнорируются, но остаются.


transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce') 
Методом to_numeric() мы не только превратим строки в числовой тип там, где это возможно, но и выясним, на каких значениях метод не работает.
Особенность метода to_numeric() в том, что при переводе все числа будут иметь тип данных float. Это подходит далеко не всем значениям. Но есть и хорошие новости: в нужный тип значения переводят методом astype(). Например, аргумент ('int') метода astype() означает, что значение нужно перевести в целое число:

In [18]:
transactions['id'] = pd.to_numeric(transactions['id'],errors='coerce')

In [19]:
transactions['id'].tail(5)

44    6.007483e+11
45    6.007483e+11
46    6.007483e+11
47    6.007483e+11
48             NaN
Name: id, dtype: float64

In [20]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: float64(1), object(2)
memory usage: 1.3+ KB

In [21]:
transactions['amount'] = pd.to_numeric(transactions['amount'],errors='coerce')

In [22]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    45 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.3+ KB

In [23]:
transactions['amount'].sum()

596107.1


Рассчитайте сумму продаж для каждой категории и сохраните в переменной transactions_per_category. Для этого сгруппируйте датафрейм transactions по столбцу category и примените метод sum() к столбцу amount. Выведите результат на экран.

In [24]:
 transactions_per_category = transactions.groupby('category')['amount'].sum()

In [25]:
print(transactions_per_category)

category
A       133988.50
B       168617.89
C       173332.50
D        62630.82
E        57537.39
Null         0.00
Name: amount, dtype: float64

In [26]:
data

     subcategory_id   source         visits  Unnamed: 3
0        cf2e61c7af   direct  501165.668858         NaN
1        0cd903d1cc   direct  126342.359505         NaN
2        ef35bc88a7   direct   95626.321402         NaN
3        6ff9f4014c   direct   75680.653002         NaN
4        72bc238e4d   direct   64435.934651         NaN
...             ...      ...            ...         ...
1925     c51343bf77  organic      15.640773         NaN
1926     d942687638  organic       13.87554         NaN
1927     976642886f  organic       9.204211         NaN
1928     075994491e  organic       4.606261         NaN
1929          total  organic      "5687882"         NaN

[1930 rows x 4 columns]

In [27]:
pd.to_numeric(data['visits'])

ValueError: Unable to parse string ""2369468"" at position 964

In [ ]:
data.loc[964]

In [ ]:
data[data['subcategory_id']=='total']

In [ ]:
data = data[data['subcategory_id']!='total']

In [ ]:
data[data['subcategory_id']=='total']

In [ ]:
data['visits'] = data['visits'].astype('int')

In [ ]:
data.info()

In [ ]:
data.groupby('source')['visits'].sum()

## Методы Pandas для работы с датой и временем
<a id='D_T'></a>

Вне зависимости от способа записи, дату и время нужно вводить в арифметические операции. Для этого в Python существует особый тип данных — datetime.

Методом to_datetime() превратим содержимое этого столбца в понятные для Python даты.
Для этого строку форматируют, обращаясь к специальной системе обозначений, где:

%d — день месяца (от 01 до 31)

%m — номер месяца (от 01 до 12)

%Y — четырёхзначный номер года (например, 2019)

Z — стандартный разделитель даты и времени

%H — номер часа в 24-часовом формате

%I — номер часа в 12-часовом формате

%M — минуты (от 00 до 59)

%S — секунды (от 00 до 59)

Преобразуем формат даты 01.04.2019Z11:03:00 из первой строчки датафрейма:


Сначала номер дня месяца. В соответствии с таблицей форматов заменяем его на %d:
%d.04.2019Z11:03:00


Далее точка (ее оставляем без изменений), потом номер месяца: %m: %d.%m.2019Z11:03:00


После четырёхзначный номер года, заменяем 2019 на %Y: %d.%m.%YZ11:03:00


Букву Z оставляем без изменений: %d.%m.%YZ11:03:00
Номер часа в 24-часовом формате заменим на %H: %d.%m.%YZ%H:03:00
Количество минут обозначим %M: %d.%m.%YZ%H:%M:00
Завершим форматирование обозначением секунд %S: %d.%m.%YZ%H:%M:%S

## arrivals['date_datetime'] = pd.to_datetime(arrivals['date'], format='%d.%m.%YZ%H:%M:%S')
## print(arrivals.head())

А у значений столбца '*target_time*' другой способ записи даты: 2019-04-01Z11:00:00. Значит, и в аргументе format сохраним другое выражение: '%Y-%m-%dZ%H:%M:%S':


## arrivals['target_datetime'] = pd.to_datetime(
##    arrivals['target_time'], format='%Y-%m-%dZ%H:%M:%S')

In [ ]:
position = pd.read_csv('position.csv')

In [ ]:
position.head(15)

In [ ]:
position.info()

In [ ]:
position['timestamp'] = pd.to_datetime(position['timestamp'],format='%Y-%m-%dT%H:%M:%S')

In [ ]:
position.info()

In [ ]:
position.sort_values(by = 'level',ascending=False)

In [ ]:
position['month'] = pd.DatetimeIndex(position['timestamp']).month

In [ ]:
position.head()

In [ ]:
position.groupby('month')['level'].mean()

## Обработка ошибок: try-except
<a id='try_except'></a>

In [ ]:
position = [
    ['2019-05-01', '6'],
    ['2019-05-02', '5'],
    ['2019-05-03', '5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', '4'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]

In [ ]:
count_lines = 0
total_position = 0

In [ ]:
for row in position:
    count_lines += 1
    level = int(row[1]) #в этой переменной сохраните позицию в выдаче 
    total_position += level#сложите все позиции в этой переменной

In [ ]:
print(total_position/count_lines)

Формат выгрузки часто согласуют заранее: это помогает избежать проблем с некорректными данными. Вот и вам разработчики прислали формат на согласование: позиция сайта в выдаче на конкретную дату.
Напишите цикл, подсчитывающий количество строк в данных. Результат выведите на экран.

In [ ]:
position = [
    ['2019-05-01', '- 6'],
    ['2019-05-02', '+5'],
    ['2019-05-03', ' 5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', 'Error 5'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]
count_lines = 0
total_position = 0

for row in position:
    count_lines += 1
    level = int(row[1]) #в этой переменной сохраните позицию в выдаче 
    total_position += level #сложите все позиции в этой переменной

In [ ]:
print(total_position/count_lines)

In [ ]:
int(+1)

In [ ]:
position = [
    ['2019-05-01', '- 6'],
    ['2019-05-02', '+5'],
    ['2019-05-03', ' 5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', 'Error 5'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]


count_lines = 0
wrong_lines_content = []

for row in position:
    count_lines+=1
    try:
        level = int(row[1])
        
    except:
        wrong_lines_content.append(row)
print('Количество измерений', count_lines)
print('Некорректные строки', wrong_lines_content)